[["0",{"pageContent":"Antonio Guiotto\n\nFront End Developer\n\nBarcelona, Spain\n\n+34 661747744 · powerhydratoni@gmail.com\n\nlinkedin.com/in/antonio-guiotto · github.com/palloncino\n\nDate of Birth: 20/03/1995\n\n\nProfessional Summary\nExperienced Software Developer with a specialization in Front-end Technologies, React, JavaScript, and Typescript. Passionate about delivering high-quality, efficient, and scalable solutions. Looking forward to contributing to a dynamic team to develop innovative software applications.","metadata":{"loc":{"lines":{"from":1,"to":15}}}}],["1",{"pageContent":"Work History\nSoftware Engineer\nOvalx, Turin\nApril 2022 — February 2023\n- Developed and maintained web applications using Typescript. \n- Created new features for preexisting onboarding websites, namely a Profile panel, where you can edit the account, switching accounts, edit nicknames, edit email preferences, edit privacy settings, and more.\n- Project Management: owned the project, updating public board about project status weekly.\n- Daily Scrum: Taking part of daily scrum, updating on current status, updating on blockers.\n- Multiple pipelines per environment with either Bitbucket or Gitlab.\n- AWS extended knowledge. \n- Utilized JIRA and Confluence for project management and documentation in an Agile team setup.\n- Collaborated with designers and QA team to ensure high-quality deliverables.\n- Implemented and maintained project management processes, contributing to high-quality code production for new projects.","metadata":{"loc":{"lines":{"from":18,"to":30}}}}],["2",{"pageContent":"- Implemented and maintained project management processes, contributing to high-quality code production for new projects.\n- Technology used were: React, Typescript, Webspack, Eslint, Babel, yarn, GIT, npm, shell scripting, SASS & more.","metadata":{"loc":{"lines":{"from":30,"to":31}}}}],["3",{"pageContent":"FrontEnd Engineer\n\nCompany: a bank\ncontract, b2b\nVicenza, Italy (remote)\nDate: undefined\nSoftware developer\nCode generations\n- Developed new architecture for a bank, architecture using microservices, with micro app in modern React\n- Business own design system\n- In this project I was involved with senior developers that teached me about Typescript and VIM and Linux.\n- Maintained pre existing application for internal bank product.\n\nSoftware Engineer\ncontract b2b\nVicenza, Italy (remote)\nDate: undefined\nSoftware developer\nMoveworkForward\n- Developing new plugin for JIRA and Confluence, Atlassian\n- Writing code in Typescript\n- Knowledge of Azure Cloud","metadata":{"loc":{"lines":{"from":33,"to":54}}}}],["4",{"pageContent":"Web Development Teacher\nForAction, Bassano del Grappa\nMay 2020 — June 2020\n- Conducted online classes, teaching about 20 students the fundamentals of web development.\n- Starting from HTML, to CSS, to JS.\n- the course was very useful for most of students\n \nFront End Developer\nRED Software Systems, Milano\nDecember 2018 — January 2020\n- Built e-commerce front-end platforms using Polymer, following an Agile workflow.\n- High focus on quality of code, strict procedures.\n- Working with pure javascript, creation of internal modules, design systems.\n- Monorepo for multiple businesses.\n- Styling with SASS\n\nEducation\n\nSchool of art in italy\n\n\nKey Skills\n\n- JavaScript\n- TypeScript\n- Git\n- NodeJs\n- React\n \n\nHobbies\n\n\n- Engaging in calisthenics\n- Riding my bicycle around\n- Design\n- Music, Musician\n\n \n\nCertifications\n \nYouthpass - EVS","metadata":{"loc":{"lines":{"from":56,"to":98}}}}]]